{"weightsManifest": [{"weights": [{"dtype": "float32", "shape": [512, 61], "name": "dense_1/kernel"}, {"dtype": "float32", "shape": [61], "name": "dense_1/bias"}], "paths": ["group1-shard1of1"]}, {"weights": [{"dtype": "float32", "shape": [61, 4096], "name": "lstm_1/kernel"}, {"dtype": "float32", "shape": [1024, 4096], "name": "lstm_1/recurrent_kernel"}, {"dtype": "float32", "shape": [4096], "name": "lstm_1/bias"}], "paths": ["group2-shard1of5", "group2-shard2of5", "group2-shard3of5", "group2-shard4of5", "group2-shard5of5"]}, {"weights": [{"dtype": "float32", "shape": [1024, 2048], "name": "lstm_2/kernel"}, {"dtype": "float32", "shape": [512, 2048], "name": "lstm_2/recurrent_kernel"}, {"dtype": "float32", "shape": [2048], "name": "lstm_2/bias"}], "paths": ["group3-shard1of4", "group3-shard2of4", "group3-shard3of4", "group3-shard4of4"]}], "modelTopology": {"keras_version": "2.1.5", "training_config": {"metrics": [], "optimizer_config": {"class_name": "Adam", "config": {"beta_1": 0.8999999761581421, "epsilon": 1e-07, "lr": 0.0020000000949949026, "beta_2": 0.9990000128746033, "decay": 0.0, "amsgrad": false}}, "loss_weights": null, "sample_weight_mode": null, "loss": "categorical_crossentropy"}, "model_config": {"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"stateful": false, "name": "lstm_1", "recurrent_constraint": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_state": false, "trainable": true, "kernel_constraint": null, "dropout": 0.0, "activity_regularizer": null, "batch_input_shape": [null, 256, 61], "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "recurrent_regularizer": null, "implementation": 1, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "return_sequences": true, "unroll": false, "units": 1024, "activation": "tanh", "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "bias_regularizer": null, "use_bias": true, "unit_forget_bias": true}}, {"class_name": "LSTM", "config": {"stateful": false, "name": "lstm_2", "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_state": false, "trainable": true, "kernel_constraint": null, "dropout": 0.0, "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "recurrent_regularizer": null, "implementation": 1, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "return_sequences": false, "unroll": false, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "kernel_regularizer": null, "unit_forget_bias": true, "units": 512, "recurrent_dropout": 0.0, "bias_regularizer": null, "use_bias": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "units": 61, "activation": "linear", "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "activation_1"}}]}, "backend": "tensorflow"}}